---
kind: type
id: T:Autodesk.Revit.DB.TextElement
source: html/013e58c3-f3d2-d976-89f0-ff4ff701951d.htm
---
# Autodesk.Revit.DB.TextElement

Base class representing text elements in Revit.

## Syntax (C#)
```csharp
public class TextElement : Element
```

## Remarks
TextElement is a base class for other annotation classes,
 like TextNote, which have additional, more specific functionality.